Hey @berkeli,

We're not able to reproduce the issue you are describing. I tested using the following resources:
```hcl
data "thousandeyes_agent" "lisbon" {
  agent_name = "Lisbon, Portugal"
}

resource "thousandeyes_alert_rule" "st-223" {
  rule_name = "ST-223: example rule"
  alert_type = "HTTP Server"

  expression = "((errorType != \"None\"))"
  minimum_sources = 1
  rounds_violating_out_of = 1
  rounds_violating_required = 1

  notifications {
    email {
      recipient = [
        "noreply@thousandeyes.com"
      ]
    }
  }
}

resource "thousandeyes_http_server" "st-223" {
  test_name      = "ST-223 Pedro: Example HTTP test"
  interval       = 120
  enabled        = true
  alerts_enabled = false

  url = "https://www.tesla.com"

  agents {
    agent_id = data.thousandeyes_agent.lisbon.agent_id
  }

  alert_rules {
    rule_id = thousandeyes_alert_rule.st-223.rule_id
  }
}
```
As you can see `alerts_enabled` is set to `false` and we're attempting to attach an alert rule to the test during its creation.

This is the terraform plan:
```
Terraform will perform the following actions:

  # thousandeyes_alert_rule.st-223 will be created
  + resource "thousandeyes_alert_rule" "st-223" {
      + alert_rule_id             = (known after apply)
      + alert_type                = "HTTP Server"
      + default                   = false
      + expression                = "((errorType != \"None\"))"
      + id                        = (known after apply)
      + minimum_sources           = 1
      + notify_on_clear           = true
      + rounds_violating_mode     = "ANY"
      + rounds_violating_out_of   = 1
      + rounds_violating_required = 1
      + rule_id                   = (known after apply)
      + rule_name                 = "ST-223: example rule"

      + notifications {
          + email {
              + recipient = [
                  + "noreply@thousandeyes.com",
                ]
            }
        }
    }

  # thousandeyes_http_server.st-223 will be created
  + resource "thousandeyes_http_server" "st-223" {
      + alerts_enabled         = false
      + api_links              = (known after apply)
      + auth_type              = "NONE"
      + bandwidth_measurements = false
      + content_regex          = ".*"
      + created_by             = (known after apply)
      + created_date           = (known after apply)
      + enabled                = true
      + follow_redirects       = true
      + http_target_time       = 1000
      + http_time_limit        = 5
      + http_version           = 2
      + id                     = (known after apply)
      + interval               = 120
      + live_share             = (known after apply)
      + modified_by            = (known after apply)
      + modified_date          = (known after apply)
      + network_measurements   = true
      + path_trace_mode        = "classic"
      + probe_mode             = "AUTO"
      + protocol               = "TCP"
      + saved_event            = (known after apply)
      + ssl_version            = (known after apply)
      + ssl_version_id         = 0
      + test_id                = (known after apply)
      + test_name              = "ST-223 Pedro: Example HTTP test"
      + type                   = (known after apply)
      + url                    = "https://www.tesla.com"
      + verify_certificate     = true

      + agents {
          + agent_id     = 98976
          + agent_type   = (known after apply)
          + ip_addresses = (known after apply)
        }

      + alert_rules {
          + rule_id = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

If I check the ThousandEyes App I see the following:
<img width="1057" alt="image" src="https://github.com/thousandeyes/terraform-provider-thousandeyes/assets/47182547/5c897f83-8c4b-44e2-9c1a-6795d16603af">
As you can see, the alert rule is attached even though alerts are disabled.

If I run terraform plan again, I get:
`No changes. Your infrastructure matches the configuration.`

Not sure if you did something different or if I didn't exactly mimic what you did. Can you help us reproduce the issue? Can you also try the above snippet to check if it works for you?

Also, what values are you passing here?
```hcl
  network_measurements = var.network_measurements
  bgp_measurements     = var.bgp_measurements
  mtu_measurements     = var.mtu_measurements
```

Thank you,
Pedro